# Загружает зависимости проекта
install:
	uv sync


# Проверяет код в папке page_analyzer на соответствие правилам линтера из ruff.toml
lint:
	uv run ruff check page_analyzer


# Исправляет замечания линтера, не связанные с логикой (порядок импортов, пробелы, и т.д.)
fix:
	uv run ruff check --fix page_analyzer


# Прогоняет все тесты
test:
	uv run pytest


# Команда проверяет покрытие кода тестами и выводит отчет в консоли.
# Примечание.
# Данный проект тестируется с помощью воркфлоу .github\workflows\hexlet-check.yml,
# где задействован фреймворк playwright для браузерного тестирования.
# Браузерное тестирование подходит для данного проекта лучше, чем подмена зависимостей для
# приложения flask и базы данных.
# Т.к. браузерное тестирование для данного случая более соответствует принципу 
# тестирования "черного ящика".
# Поэтому доп. тесты в данном приложении реализованы минимально.
test-coverage:
	uv run pytest --cov=page_analyzer


# Прогоняет сначала тесты, потом проверку линтером
check: test lint


# Запускает скрипт для установки uv и зависимостей проекта для платформы render.com
build:
	./build.sh


# Запускает локальный сервер
dev:
	uv run flask --debug --app page_analyzer:app run


# Запускает приложение в режиме продакшена. 
# Приложение будет доступно по адресу http://localhost:8000, 
# если в переменных окружения не указан порт, необходимый для деплоя
PORT ?= 8000
start:
	uv run gunicorn -w 5 -b 0.0.0.0:$(PORT) page_analyzer:app


# Запускает сервер в продакшене на платформе render.com (там все зависимости устанавливаются глобально)
render-start:
	gunicorn -w 5 -b 0.0.0.0:$(PORT) page_analyzer:app


# Команды, которые могут совпадать с именами директорий и не должны быть с ними перепутаны
.PHONY: install test lint selfcheck check build